app/Models/m_admin.php

	public function get_data($username, $password)
	{
      return $this->db->table('admin')
      ->where(array('username' => $username, 'password' => $password))
      ->get()->getRowArray();
---
SELECT *
FROM `admin`
WHERE `username` = '123123'
AND `password` = '123123'